Revit 2024 API
BuiltInFailures.SlabShapeFailures.SlopedInnerEdge Property
 Inner loops of a footprint sketch may not have slope-defining lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SlopedInnerEdge { get; }
Visual Basic
Public Shared ReadOnly Property SlopedInnerEdge As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SlopedInnerEdge {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace